In [1]:
import pandas as pd

In [4]:
london_tweets = pd.read_csv("./data/london_tweets.csv", )

In [5]:
london_tweets.head()

,id,Name,X,Y,LONGITUDE,LATITUDE,MESSAGEDATE,USERID,USERSCREENNAME,MESSAGETEXT,LOCATION,HASHTAGS,ISRETWEET,DATETIME
0,550226818624942080,NaN,-0.262150,51.391407,-0.262150,51.391407,31/12/2014 09:47:50,113918054,12Elbestreet,@julieo25 Not yet got tics for Liverpool waiti...,Kingston upon Thames; London,NaN,0,2014-12-31 09:47:50
1,550226823314178048,NaN,-0.149466,51.492560,-0.149466,51.492561,31/12/2014 09:47:52,465989904,alice_foster_95,So. Many. Accents #alicesadventureswithmegabus,London; England,alicesadventureswithmegabus,0,2014-12-31 09:47:52
2,550226827944660992,NaN,-0.014891,51.354042,-0.014891,51.354042,31/12/2014 09:47:53,55872342,MissGee_Pee,If it doesn't make you happy by December 31st....,New Addington; London,NaN,0,2014-12-31 09:47:53
3,550226837537058816,NaN,0.006698,51.532020,0.006698,51.532021,31/12/2014 09:47:55,147266450,vinita_ramtri,@westfieldstrat thanks; and are you open tomor...,Stratford; London,NaN,0,2014-12-31 09:47:55
4,550227214227505152,NaN,0.214417,51.582535,0.214417,51.582535,31/12/2014 09:49:25,518928608,CallumGordon7,@WestHam_Central but he is,Romford; London,NaN,0,2014-12-31 09:49:25

In [7]:
london_tweets.LOCATION.unique().size

46

In [9]:
london_tweets.groupby("LOCATION").agg("count")["id"]

LOCATION
Barking; London                 2035
Barnet; London                  4290
Bexley; London                  1807
Biggin Hill; London               67
Brent; London                   2585
Bromley; London                 3514
Camberwell; London              4142
Camden Town; London             4157
City of London; London          1062
Crayford; London                 987
Croydon; London                 3579
Downe; London                      3
Ealing; London                  1738
East Ham; London                1507
Eltham; London                  1351
Enfield; London                 3603
Greenwich; London               1681
Hackney; London                 3935
Hammersmith; London             2332
Harefield; London                113
Harrow; London                  2015
Hazlewood; London                 11
Hillingdon; London              4079
Hounslow; London                1582
Ilford; London                  2166
Islington; London               3239
Kensington; London              2620
Keston; London                    25
Kingston upon Thames; London    1395
Lambeth; London                 4817
Lewisham; London                2356
London; England                 8771
Merton; London                  1811
New Addington; London            186
Paddington; London              3712
Poplar; London                  4114
Pratts Bottom; London              6
Richmond; London                1864
Romford; London                 2936
Southall; London                 632
Stratford; London               2301
Sutton; London                  1534
Tottenham; London               3590
Walthamstow; London             2597
Wandsworth; London              3702
Westerham; London                  1
Name: id, dtype: int64

In [10]:
# For each borough
# * Group tweets by hour intervals
# * For each hour interval, group tweets by borough

In [11]:
tweets_by_datetime_and_location = london_tweets[["LOCATION","DATETIME"]]

In [12]:
tweets_by_datetime_and_location.head()

                       LOCATION             DATETIME
0  Kingston upon Thames; London  2014-12-31 09:47:50
1               London; England  2014-12-31 09:47:52
2         New Addington; London  2014-12-31 09:47:53
3             Stratford; London  2014-12-31 09:47:55
4               Romford; London  2014-12-31 09:49:25

In [24]:
tweets_by_datetime_and_location[tweets_by_datetime_and_location.LOCATION == "Pratts Bottom; London"]

                    LOCATION             DATETIME            datetime
15642  Pratts Bottom; London  2014-12-31 18:23:08 2014-12-31 18:23:08
19321  Pratts Bottom; London  2014-12-31 16:01:13 2014-12-31 16:01:13
51808  Pratts Bottom; London  2015-01-01 03:08:44 2015-01-01 03:08:44
93076  Pratts Bottom; London  2015-01-01 22:04:10 2015-01-01 22:04:10
93194  Pratts Bottom; London  2015-01-01 21:40:20 2015-01-01 21:40:20
97801  Pratts Bottom; London  2015-01-01 22:22:34 2015-01-01 22:22:34

In [19]:
tweets_by_datetime_and_location["datetime"] = pd.to_datetime(tweets_by_datetime_and_location.DATETIME)

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [25]:
pratts_bottom_tweets = tweets_by_datetime_and_location[tweets_by_datetime_and_location.LOCATION == "Pratts Bottom; London"]
pratts_bottom_tweets.head()

                    LOCATION             DATETIME            datetime
15642  Pratts Bottom; London  2014-12-31 18:23:08 2014-12-31 18:23:08
19321  Pratts Bottom; London  2014-12-31 16:01:13 2014-12-31 16:01:13
51808  Pratts Bottom; London  2015-01-01 03:08:44 2015-01-01 03:08:44
93076  Pratts Bottom; London  2015-01-01 22:04:10 2015-01-01 22:04:10
93194  Pratts Bottom; London  2015-01-01 21:40:20 2015-01-01 21:40:20

In [40]:
times = pd.to_datetime(pratts_bottom_tweets.DATETIME)
group_conditions = [times.dt.year, times.dt.month, times.dt.day, times.dt.hour]
pratts_bottom_tweets.groupby(group_conditions).count()

                                     LOCATION  DATETIME  datetime
DATETIME DATETIME DATETIME DATETIME
2014     12       31       16               1         1         1
                           18               1         1         1
2015     1        1        3                1         1         1
                           21               1         1         1
                           22               2         2         2

In [45]:
times = pd.to_datetime(tweets_by_datetime_and_location.DATETIME)
group_conditions = [tweets_by_datetime_and_location.LOCATION, times.dt.year, times.dt.month, times.dt.day, times.dt.hour]
hourly_tweets_by_location = tweets_by_datetime_and_location.groupby(group_conditions).count()

In [46]:
hourly_tweets_by_location.head()

                                                     DATETIME  datetime
LOCATION        DATETIME DATETIME DATETIME DATETIME
Barking; London 2014     12       31       4                7         7
                                           5                2         2
                                           6                6         6
                                           7                9         9
                                           8               24        24

In [50]:
hourly_tweets_by_location.iloc[0]

DATETIME    7
datetime    7
Name: (Barking; London, 2014, 12, 31, 4), dtype: int64